commun_ity_back/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    token = request.headers['Authorization']
    id = JWT.decode(token, 'secret', false)[0]['id']
    current_user = User.find(id)