commun_ity_back/app/controllers/communities_controller.rb

  def index
    communities = Community.all
---
SELECT "communities".* FROM "communities"

  def show
    community = Community.find(params[:id])
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]