commun_ity_back/app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    event = Event.find(params[:id])