commun_ity_back/app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."community_id" = $1  [["community_id", 5]]
---
  def index
    memberships = Membership.all

INSERT INTO "memberships" ("member_type", "user_id", "community_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["member_type", "member"], ["user_id", 11], ["community_id", 6], ["created_at", "2017-12-28 18:11:53.064425"], ["updated_at", "2017-12-28 18:11:53.064425"]]
---
  def create
    membership = Membership.new(membership_params)
    if membership.save