commun_ity_back/app/controllers/tasks_controller.rb

    task = Task.find(params[:id])
    byebug
    task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", "t"], ["updated_at", "2017-12-29 17:14:17.685751"], ["id", 1]]